/*1018. 锤子剪刀布 (20)

大家应该都会玩“锤子剪刀布”的游戏：两人同时给出手势，胜负规则如图所示：


现给出两人的交锋记录，请统计双方的胜、平、负次数，并且给出双方分别出什么手势的胜算最大。

输入格式：

输入第1行给出正整数N（<=10^5），即双方交锋的次数。随后N行，每行给出一次交锋的信息，即甲、乙双方同时给出的的手势。C代表“锤子”、J代表“剪刀”、B代表“布”，第1个字母代表甲方，第2个代表乙方，中间有1个空格。

输出格式：

输出第1、2行分别给出甲、乙的胜、平、负次数，数字间以1个空格分隔。第3行给出两个字母，分别代表甲、乙获胜次数最多的手势，中间有1个空格。如果解不唯一，则输出按字母序最小的解。

输入样例：
10
C J
J B
C B
B B
B C
C C
C B
J B
B C
J J
输出样例：
5 3 2
2 3 5
B B
*/
#include <stdio.h>
int max(int a[])
{
  int max=-1,index;
  if(a['B']>max)
  {
    max=a['B'];
    index='B';
  }
  if(a['C']>max)
  {
    max=a['C'];
    index='C';
  }
  if(a['J']>max)
  {
    max=a['J'];
    index='J';
  }
  return index;
}
int main()
{
  char j,y;
  int N,s=0,p=0,f=0,jc[100]={0},yc[100]={0};
  scanf("%d",&N);
  while(N--)
  {
    scanf(" %c %c",&j,&y);
    if((j=='C'&&y=='C')||(j=='J'&&y=='J')||(j=='B'&&y=='B')) p++;
    if((j=='C'&&y=='J')||(j=='J'&&y=='B')||(j=='B'&&y=='C'))
    {
      s++;
      jc[j]++;
    }
    if((y=='C'&&j=='J')||(y=='J'&&j=='B')||(y=='B'&&j=='C'))
    {
      f++;
      yc[y]++;
    }
  }
  printf("%d %d %d\n",s,p,f);
  printf("%d %d %d\n",f,p,s);
  printf("%c %c",max(jc),max(yc));
  return 0;
}
